silabs-bozont/arduino/boards.txt
nano_matter.menu.protocol_stack.none.build.precompiled_libs="{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

nano_matter.menu.protocol_stack.ble_arduino.build.precompiled_libs="{build.variant.path}/ble_arduino/libbgcommon.a" "{build.variant.path}/ble_arduino/liblinklayer.a" "{build.variant.path}/ble_arduino/librail_config_mgm240sd22vna_gcc.a" "{build.variant.path}/ble_arduino/librail_module_efr32xg24_gcc_release.a" "{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

nano_matter.menu.protocol_stack.ble_silabs.build.precompiled_libs="{build.variant.path}/ble_silabs/libbgapi_core.a" "{build.variant.path}/ble_silabs/libbgcommon.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_client.a" "{build.variant.path}/ble_silabs/libble_bgapi_gatt_server.a" "{build.variant.path}/ble_silabs/libble_bgapi.a" "{build.variant.path}/ble_silabs/libble_host_accept_list_stub.a" "{build.variant.path}/ble_silabs/libble_host_hal_series2.a" "{build.variant.path}/ble_silabs/libble_host_hci.a" "{build.variant.path}/ble_silabs/libble_host.a" "{build.variant.path}/ble_silabs/libble_system.a" "{build.variant.path}/ble_silabs/libbondingdb.a" "{build.variant.path}/ble_silabs/liblinklayer.a" "{build.variant.path}/ble_silabs/librail_config_mgm240sd22vna_gcc.a" "{build.variant.path}/ble_silabs/librail_module_efr32xg24_gcc_release.a" "{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

nano_matter.menu.protocol_stack.matter.build.precompiled_libs="{build.variant.path}/matter/libProvision_mgm24.a" "{build.variant.path}/matter/libbgcommon.a" "{build.variant.path}/matter/liblinklayer.a" "{build.variant.path}/matter/libble_bgapi_gatt_server.a" "{build.variant.path}/matter/libbgapi_core.a" "{build.variant.path}/matter/libble_host_accept_list_stub.a" "{build.variant.path}/matter/libble_host.a" "{build.variant.path}/matter/libbondingdb_stub.a" "{build.variant.path}/matter/libble_bgapi.a" "{build.variant.path}/matter/libble_bgapi_stub_gatt_client.a" "{build.variant.path}/matter/libble_host_hal_series2.a" "{build.variant.path}/matter/libble_host_hci.a" "{build.variant.path}/matter/libble_system.a" "{build.variant.path}/matter/libsl_openthread_cm33_gcc.a" "{build.variant.path}/matter/libsl_ot_stack_ftd_efr32mg24_gcc.a" "{build.variant.path}/matter/librail_config_mgm240sd22vna_gcc.a" "{build.variant.path}/matter/librail_multiprotocol_module_efr32xg24_gcc_release.a" "{build.variant.path}/matter/libsl_openthread_cm33_gcc.a" "{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

nano_matter.menu.protocol_stack.zigbee.build.precompiled_libs="{build.variant.path}/zigbee/librail_config_mgm240sd22vna_gcc.a" "{build.variant.path}/zigbee/librail_module_efr32xg24_gcc_release.a" "{build.variant.path}/zigbee/libzigbee-pro-stack.a" "{build.variant.path}/zigbee/libzigbee-gp.a" "{build.variant.path}/zigbee/libzigbee-source-route.a" "{build.variant.path}/zigbee/libzigbee-zll.a" "{build.variant.path}/zigbee/libcmsis-nn.a" "{build.variant.path}/zigbee/libtflm.a"

nano_matter.build.board_specific_macros='-DARDUINO_NANO_MATTER' '-DNUM_LEDS=3' '-DNUM_BTN=1' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=2' '-DNUM_HW_I2C=2' '-DNUM_DAC_HW=2' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

nano_matter.menu.protocol_stack.zigbee.build.extra_flags={build.board_specific_macros} '-DARDUINO_ZIGBEE' '-DARDUINO_SILABS_STACK_ZIGBEE' '-DARDUINO_SILABS_AIML_CAPABLE' '-DMGM240SD22VNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2707A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1' '-DNDEBUG=1' '-DTF_LITE_STRIP_ERROR_STRINGS=1' '-DCMSIS_NN=1' '-DCMSIS_NVIC_VIRTUAL=1' '-DCMSIS_NVIC_VIRTUAL_HEADER_FILE="cmsis_nvic_virtual.h"' '-DCORTEXM3=1' '-DCORTEXM3_EFM32_MICRO=1' '-DCORTEXM3_EFR32=1' '-DPHY_RAIL=1' '-DPLATFORM_HEADER="platform-header.h"' '-DSL_LEGACY_HAL_ENABLE_WATCHDOG=1' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DCUSTOM_TOKEN_HEADER="sl_token_manager_af_token_header.h"' '-DUSE_NVM3=1' '-DSL_ZIGBEE_MULTI_NETWORK_STRIPPED=1' '-DSL_ZIGBEE_PHY_SELECT_STACK_SUPPORT=1' '-DSL_ZIGBEE_STACK_COMPLIANCE_REVISION=22' '-DSTACK_CORE_HEADER="stack/core/sl_zigbee_stack.h"' '-DSTACK_HEADER="stack/include/sl_zigbee.h"' '-DSTACK_TYPES_HEADER="stack/include/sl_zigbee_types.h"' '-DCONFIGURATION_HEADER="app/framework/util/config.h"' '-DNVM3_DEFAULT_NVM_SIZE=32768'

nano_matter.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_NONE' '-DARDUINO_SILABS_AIML_CAPABLE' '-DMGM240SD22VNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2707A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DTF_LITE_STATIC_MEMORY=1'

nano_matter.menu.protocol_stack.ble_arduino.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_ARDUINO' '-DARDUINO_SILABS_AIML_CAPABLE' '-DMGM240SD22VNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2707A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DTF_LITE_STATIC_MEMORY=1'

nano_matter.menu.protocol_stack.ble_silabs.build.extra_flags={build.board_specific_macros} '-DARDUINO_SILABS_STACK_BLE_SILABS' '-DARDUINO_SILABS_AIML_CAPABLE' '-DMGM240SD22VNA=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2707A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DTF_LITE_STATIC_MEMORY=1'

nano_matter.menu.protocol_stack.matter.build.extra_flags={build.board_specific_macros} '-DARDUINO_MATTER' '-DARDUINO_MATTER_OVER_THREAD' '-DARDUINO_SILABS_STACK_MATTER_OVER_THREAD' '-DARDUINO_SILABS_AIML_CAPABLE' '-DCHIP_CRYPTO_PLATFORM=1' '-DIS_DEMO_LIGHT=1' '-DNVM3_DEFAULT_MAX_OBJECT_SIZE=4092' '-DNVM3_DEFAULT_NVM_SIZE=40960' '-DSL_OPENTHREAD_CERT_LIB=1' '-DSL_STATUS_LED=0' '-D_WANT_REENT_SMALL=1' '-DconfigNUM_THREAD_LOCAL_STORAGE_POINTERS=2' '-DconfigNUM_USER_THREAD_LOCAL_STORAGE_POINTERS=0' '-DCHIP_ADDRESS_RESOLVE_IMPL_INCLUDE_HEADER=<lib/address_resolve/AddressResolve_DefaultImpl.h>' '-DCHIP_HAVE_CONFIG_H=1' '-DRADIO_CONFIG_DMP_SUPPORT=1' '-DCHIP_DNSSD_DEFAULT_PLATFORM=1' '-DCHIP_CRYPTO_KEYSTORE_PSA=1' '-DCURRENT_TIME_NOT_IMPLEMENTED=1' '-DSL_MATTER_GN_BUILD=0' '-DMBEDTLS_USER_CONFIG_FILE=<sli_psa_builtin_config.h>' '-DOPENTHREAD_CONFIG_DETERMINISTIC_ECDSA_ENABLE=0' '-DOPENTHREAD_CONFIG_ENABLE_BUILTIN_MBEDTLS=0' '-DSILABS_LOG_OUT_UART=0' '-DNON_SPEC_COMPLIANT_OTA_ACTION_DELAY_FLOOR=-1' '-DSILABS_OTA_ENABLED=1' '-DRTT_USE_ASM=0' '-DOPENTHREAD_CONFIG_DNS_CLIENT_OVER_TCP_ENABLE=0' '-DOPENTHREAD_CONFIG_TCP_ENABLE=0' '-DMGM240SD22VNA=1' '-DSL_CODE_COMPONENT_SYSTEM=system' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD4002A"' '-DSL_BOARD_REV="A07"' '-DSL_CODE_COMPONENT_CLOCK_MANAGER=clock_manager' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DSL_CODE_COMPONENT_DEVICE_PERIPHERAL=device_peripheral' '-DSL_CODE_COMPONENT_DMADRV=dmadrv' '-DSL_CODE_COMPONENT_FREERTOS_KERNEL=freertos_kernel' '-DSL_CODE_COMPONENT_HAL_COMMON=hal_common' '-DSL_CODE_COMPONENT_HAL_GPIO=hal_gpio' '-DSL_CODE_COMPONENT_HAL_SYSRTC=hal_sysrtc' '-DCMSIS_NVIC_VIRTUAL=1' '-DCMSIS_NVIC_VIRTUAL_HEADER_FILE="cmsis_nvic_virtual.h"' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DOPENTHREAD_CONFIG_DIAG_ENABLE=1' '-DOPENTHREAD_CORE_CONFIG_PLATFORM_CHECK_FILE="openthread-core-efr32-config-check.h"' '-DOPENTHREAD_PROJECT_CORE_CONFIG_FILE="openthread-core-efr32-config.h"' '-DSL_CODE_COMPONENT_OT_PLATFORM_ABSTRACTION=ot_platform_abstraction' '-DOPENTHREAD_CONFIG_FILE="sl_openthread_generic_config.h"' '-DOPENTHREAD_FTD=1' '-DSL_OPENTHREAD_STACK_FEATURES_CONFIG_FILE="sl_openthread_features_ftd_cert_config.h"' '-DSL_CODE_COMPONENT_POWER_MANAGER=power_manager' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=1' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSL_CODE_COMPONENT_SE_MANAGER=se_manager' '-DCIRCULAR_QUEUE_USE_LOCAL_CONFIG_HEADER=1' '-DSL_CODE_COMPONENT_CORE=core' '-DSL_CODE_COMPONENT_SLEEPTIMER=sleeptimer' '-DSL_CODE_COMPONENT_SLI_CRYPTO=sli_crypto' '-DSLI_RADIOAES_REQUIRES_MASKING=1' '-DSL_CODE_COMPONENT_SLI_PROTOCOL_CRYPTO=sli_protocol_crypto' '-DSL_CODE_COMPONENT_PSEC_OSAL=psec_osal' '-DSL_CODE_COMPONENT_SPIDRV=spidrv' '-DTF_LITE_STATIC_MEMORY=1'

nano_matter.build.float_flags=

nano_matter.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

### Radioless build flags
#########################
nano_matter.menu.protocol_stack.none.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c18 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -Wno-unused-parameter

nano_matter.menu.protocol_stack.none.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=gnu++17 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g -fno-exceptions -Wno-unused-parameter

nano_matter.menu.protocol_stack.none.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections -Wl,--wrap=_free_r -Wl,--wrap=_malloc_r -Wl,--wrap=_calloc_r -Wl,--wrap=_realloc_r

