silabs-bozont/arduino/boards.txt
xg24devkit.menu.protocol_stack.matter.build.include_list="-I{build.variant.path}/matter" "-I{build.variant.path}/matter/autogen" "-I{build.variant.path}/matter/autogen/zap-generated" "-I{build.variant.path}/matter/autogen/zap-generated/app-common/zap-generated" "-I{build.variant.path}/matter/autogen/zap-generated/app-common/zap-generated/attributes" "-I{build.variant.path}/matter/autogen/zap-generated/app-common/zap-generated/ids" "-I{build.variant.path}/matter/autogen/zap-generated/app" "-I{build.variant.path}/matter/autogen/zap-generated/attributes" "-I{build.variant.path}/matter/config" "-I{build.variant.path}/matter/config/app/icd/server" "-I{build.variant.path}/matter/config/matter/tracing" "-I{build.variant.path}/matter/config/btconf" "-I{build.variant.path}/matter/config/app" "-I{build.variant.path}/matter/config/prioconf" "-I{build.variant.path}/matter/config/common" "-I{build.variant.path}/matter/include" "-I{build.matter_sdk_path}/third_party/matter_sdk/examples/platform/silabs" "-I{build.matter_sdk_path}/third_party/matter_sdk/src" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib" "-I{build.matter_sdk_path}/third_party/nlassert/include" "-I{build.matter_sdk_path}/third_party/nlio/include" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/address_resolve" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/reporting" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/ember_coupling" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/data-model-provider" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/codegen-data-model-provider" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/dnssd" "-I{build.matter_sdk_path}/third_party/matter_sdk/examples/platform/silabs/efr32" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/efr32" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include/platform" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include/platform/internal" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/logging" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/include/platform/internal/testing" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/dnssd/platform" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/common" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lwip/silabs" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/platformAbstraction" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/OpenThread" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/FreeRTOS" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/core" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/access" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/access/examples" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/asn1" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/bdx" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/ble" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/crypto" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/user_directed_commissioning" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/secure_channel" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/echo" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials/examples" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials/attestation_verifier" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/credentials/tests" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/inet" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/protocols/interaction_model" "-I{build.matter_sdk_path}/third_party/matter_sdk/examples/providers" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/messaging" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/transport/raw" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/setup_payload" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/support/logging" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/support" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/lib/support/verhoeff" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/system" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/transport" "-I{build.matter_sdk_path}/third_party/matter_sdk" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/icd/server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/access-control-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/basic-information" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/cluster-building-blocks" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/color-control-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/descriptor" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/diagnostic-logs-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/door-lock-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/fan-control-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/general-commissioning-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/general-diagnostics-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/groups-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/identify-server" "-I{build.matter_sdk_path}/slc/inc" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/level-control" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/network-commissioning" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/occupancy-sensor-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/on-off-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/controller" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/ota-requestor" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/provision" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/scenes-server" "-I{build.matter_sdk_path}/slc/component/sdk-content/simplicity-sdk/util/third_party/segger/systemview/SEGGER" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/software-diagnostics-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/switch-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/thermostat-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/clusters/thread-network-diagnostics-server" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/tracing" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/platform/silabs/tracing" "-I{build.matter_sdk_path}/third_party/matter_sdk/src/app/MessageDef"

xg24devkit.menu.protocol_stack.none.build.precompiled_libs="{build.variant.path}/noradio/libcmsis-nn.a" "{build.variant.path}/noradio/libtflm.a"

