silabs-bozont/arduino/boards.txt
xiao_mg24.menu.protocol_stack.ble_arduino.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_arduino/include"
xiao_mg24.menu.protocol_stack.ble_silabs.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble_silabs/include"
xiao_mg24.menu.protocol_stack.zigbee.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/zigbee/autogen" "-I{build.variant.path}/zigbee/config" "-I{build.variant.path}/zigbee/config/prioconf" "-I{build.variant.path}/zigbee/config/zcl" "-I{build.variant.path}/zigbee" "-I{build.variant.path}/zigbee/aiml/flatbuffers/include" "-I{build.variant.path}/zigbee/aiml/gemmlowp" "-I{build.variant.path}/zigbee/aiml/ruy" "-I{build.variant.path}/zigbee/aiml/inc" "-I{build.variant.path}/zigbee/aiml/third_party/tflite-micro" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG24/Include" "-I{build.variant.path}/zigbee/simplicity_sdk/app/common/util/app_assert" "-I{build.variant.path}/zigbee/simplicity_sdk/app/common/util/app_log" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/common/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/hardware/board/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/bootloader" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/bootloader/api" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/bootloader/core/flash" "-I{build.variant.path}/zigbee/simplicity_sdk/util/plugin/byte_utilities" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/clock_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/clock_manager/src" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/CMSIS/Core/Include" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/cmsis/nn" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/cmsis/nn/Include" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/CMSIS/RTOS2/Include" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/compute/util/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/hardware/driver/configuration_over_swo/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/driver/debug/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/device_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/device_init/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/dmadrv/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/dmadrv/inc/s2_signals" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/compute/driver/mvp/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/common/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emlib/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin/fem_util" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/freertos/kernel/include" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/freertos/cmsis/Include" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/freertos/kernel/portable/GCC/ARM_CM33_NTZ/non_secure" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/driver/gpio/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/gpiointerrupt/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/peripheral/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/hfxo_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/driver/i2cspm/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/interrupt_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/interrupt_manager/inc/arm" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/iostream/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/legacy_hal/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/legacy_hal_wdog/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/compute/math/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/compute/math/mvp/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/security/sl_component/sl_mbedtls_support/config" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/security/sl_component/sl_mbedtls_support/config/preset" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/security/sl_component/sl_mbedtls_support/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/mbedtls/include" "-I{build.variant.path}/zigbee/simplicity_sdk/util/third_party/mbedtls/library" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/memory_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/memory_manager/src" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/mpu/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/compute/nn/mvp/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/compute/nn/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/nvm3/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/nvm3/config" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/power_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/security/sl_component/sl_psa_driver/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/driver/pwm/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/common" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/protocol/ble" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/protocol/ieee802154" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/protocol/wmbus" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/protocol/zwave" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/chip/efr32/efr32xg2x" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/protocol/sidewalk" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin/rail_util_ieee802154" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin/pa-conversions" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin/pa-conversions/efr32xg24" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin/rail_util_power_manager_init" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin/rail_util_pti" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/security/sl_component/se_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/util/plugin/security_manager" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/common/toolchain/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/system/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/sleeptimer/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/security/sl_component/sli_psec_osal/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/emdrv/spidrv/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/token_manager/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/service/udelay/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/basic" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/service-function" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/counters" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/find-and-bind-target" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/include" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/gp" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/internal/inc" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/internal/src/ipc" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/green-power-client" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/green-power-common" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/groups-server" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/identify" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/network-creator" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/network-creator-security" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/network-steering" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/on-off" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/reporting" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/scan-dispatch" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/interpan" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/level-control" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/scenes" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-common" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-server" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/zll-level-control-server" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/zll-on-off-server" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/zll-scenes-server" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/zll" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/security" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/signature-decode" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/rail_lib/plugin" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/util/counters" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/zigbee" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/mac/rail_mux" "-I{build.variant.path}/zigbee/simplicity_sdk/platform/radio/mac" "-I{build.variant.path}/zigbee/simplicity_sdk/util/silicon_labs/silabs_core" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/core" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/stack/mac" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/em260" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/common" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/plugin/update-tc-link-key" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/include" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/util" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/security" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/util/zigbee-framework" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/framework/cli" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/util/common" "-I{build.variant.path}/zigbee/simplicity_sdk/protocol/zigbee/app/util/security"
xiao_mg24.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

